mdutton3/lasso/lasso/xml/saml-2.0/xml_saml2.h
/* $Id$
 *
 * Lasso - A free implementation of the Liberty Alliance specifications.
 *
 * Copyright (C) 2004-2007 Entr'ouvert
 * http://lasso.entrouvert.org
 *
 * Authors: See AUTHORS file in top-level directory.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 */

#ifndef __LASSO_XML_SAML2_H__
#define __LASSO_XML_SAML2_H__

#include "./saml2_action.h"
#include "./saml2_advice.h"
#include "./saml2_assertion.h"
#include "./saml2_attribute.h"
#include "./saml2_attribute_statement.h"
#include "./saml2_attribute_value.h"
#include "./saml2_audience_restriction.h"
#include "./saml2_authn_context.h"
#include "./saml2_authn_statement.h"
#include "./saml2_authz_decision_statement.h"
#include "./saml2_base_idabstract.h"
#include "./saml2_condition_abstract.h"
#include "./saml2_conditions.h"
#include "./saml2_encrypted_element.h"
#include "./saml2_evidence.h"
#include "./saml2_key_info_confirmation_data.h"
#include "./saml2_key_info_confirmation_data_type.h"
#include "./saml2_name_id.h"
#include "./saml2_one_time_use.h"
#include "./saml2_proxy_restriction.h"
#include "./saml2_statement_abstract.h"
#include "./saml2_subject_confirmation_data.h"
#include "./saml2_subject_confirmation.h"
#include "./saml2_subject.h"
#include "./saml2_subject_locality.h"
#include "./samlp2_artifact_resolve.h"
#include "./samlp2_artifact_response.h"
#include "./samlp2_assertion_id_request.h"
#include "./samlp2_attribute_query.h"
#include "./samlp2_authn_query.h"
#include "./samlp2_authn_request.h"
#include "./samlp2_authz_decision_query.h"
#include "./samlp2_extensions.h"
#include "./samlp2_idp_entry.h"
#include "./samlp2_idp_list.h"
#include "./samlp2_logout_request.h"
#include "./samlp2_logout_response.h"
#include "./samlp2_manage_name_id_request.h"
#include "./samlp2_manage_name_id_response.h"
#include "./samlp2_name_id_mapping_request.h"
#include "./samlp2_name_id_mapping_response.h"
#include "./samlp2_name_id_policy.h"
#include "./samlp2_request_abstract.h"
#include "./samlp2_requested_authn_context.h"
#include "./samlp2_response.h"
#include "./samlp2_scoping.h"
#include "./samlp2_status_code.h"
#include "./samlp2_status_detail.h"
#include "./samlp2_status.h"
#include "./samlp2_status_response.h"
#include "./samlp2_subject_query_abstract.h"
#include "./samlp2_terminate.h"

#endif /* __LASSO_XML_SAML2_H__ */
